ccmcomputing/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Seeeduino Zero
# ---------------------------------------
zero.name=Seeeduino Zero
zero.vid.0=0x2886
zero.pid.0=0x800B
zero.vid.1=0x2886
zero.pid.1=0x000B

zero.upload.tool=bossac
zero.upload.protocol=sam-ba
zero.upload.maximum_size=262144
zero.upload.use_1200bps_touch=true
zero.upload.wait_for_upload_port=true
zero.upload.native_usb=true
zero.build.mcu=cortex-m0plus
zero.build.f_cpu=48000000L
zero.build.usb_product="Seeeduino Zero"
zero.build.usb_manufacturer="Seeed Studio"
zero.build.board=SAMD_ZERO
zero.build.core=arduino
zero.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
zero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
zero.build.openocdscript=openocd_scripts/arduino_zero.cfg
zero.build.variant=arduino_zero
zero.build.variant_system_lib=
zero.build.vid=0x2886
zero.build.pid=0x800B
zero.bootloader.tool=openocd
zero.bootloader.file=zero/samd21_sam_ba.bin

# Seeeduino LoRaWAN
# ---------------------------------------
rolawan.name=Seeeduino LoRaWAN
rolawan.vid.0=0x2886
rolawan.pid.0=0x800C
rolawan.vid.1=0x2886
rolawan.pid.1=0x000C

rolawan.upload.tool=bossac
rolawan.upload.protocol=sam-ba
rolawan.upload.maximum_size=262144
rolawan.upload.use_1200bps_touch=true
rolawan.upload.wait_for_upload_port=true
rolawan.upload.native_usb=true
rolawan.build.mcu=cortex-m0plus
rolawan.build.f_cpu=48000000L
rolawan.build.usb_product="Seeeduino LoRaWAN"
rolawan.build.usb_manufacturer="Seeed Studio"
rolawan.build.board=SAMD_ZERO
rolawan.build.core=arduino
rolawan.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
rolawan.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
rolawan.build.openocdscript=openocd_scripts/arduino_zero.cfg
rolawan.build.variant=arduino_zero
rolawan.build.variant_system_lib=
rolawan.build.vid=0x2886
rolawan.build.pid=0x800C
rolawan.bootloader.tool=openocd
rolawan.bootloader.file=lorawan/samd21_sam_ba.bin

# Wio GPS Board
# ---------------------------------------
WioGPS.name=Wio GPS Board
WioGPS.vid.0=0x2886
WioGPS.pid.0=0x800E
WioGPS.vid.1=0x2886
WioGPS.pid.1=0x000E

WioGPS.upload.tool=bossac
WioGPS.upload.protocol=sam-ba
WioGPS.upload.maximum_size=262144
WioGPS.upload.use_1200bps_touch=true
WioGPS.upload.wait_for_upload_port=true
WioGPS.upload.native_usb=true
WioGPS.build.mcu=cortex-m0plus
WioGPS.build.f_cpu=48000000L
WioGPS.build.usb_product="Wio GPS Board"
WioGPS.build.usb_manufacturer="Seeed Studio"
WioGPS.build.board=SAMD_ZERO
WioGPS.build.core=arduino
WioGPS.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DWIO_GPS_BOARD
WioGPS.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
WioGPS.build.openocdscript=openocd_scripts/arduino_zero.cfg
WioGPS.build.variant=arduino_zero
WioGPS.build.variant_system_lib=
WioGPS.build.vid=0x2886
WioGPS.build.pid=0x800E
WioGPS.bootloader.tool=openocd
WioGPS.bootloader.file=wioGPS/samd21_sam_ba.bin

